// const {Bot} = require('grammy'); // імпортуємо за допомогою require клас 'Bot' із 'grammy'

/*создаєм свого бота на основі імпортованого класа передаючи в 
качестві аргумента строку з унікальним токеном, який отримали раніше від 'BotFather' 
*/
// const bot = new Bot('6514896206:AAG2PQWwhKxbQxUhqksBGKaPeBQDNmVRvqc');
/** 
 * Запускаєм бота.
 * Коли ми запустимо бота він буде працювати але не буде нічого робити
 * Але нам потрвбно якось оброблчти повідомлення від користувача якось реагувати на дії, 
 * щоб бот працював.
 * зараз в боті є прблема (відкритий токен), якщо ми загрузимо бота на гітхаб наш бот буде
 * скопромітован, що відкритий токен.
 * щоб цього не було нам потрібно зберігати такі змінні в качестві зміних окруженія 
 * створимо окремий файл `.env` в корні проекту і перемістимо туди токен назвав зміну зним 'bot_api_key'
*/


/**Після того як створили файл .env 
 * нам потрібно імпортувати бібліотеку `.env` і токен буде доступний по визову 
*/

/**Тепер реалізуємо базові сценарії:
 * -реагування на команду старт
 * -відповідь на сповіщення
 * -обработку помилок
 * щоб реагувати на команди від користувача нам потрібно встановити слушатель собитій команда
 * з помощю метода `command` у бота.
 * Добавляются слушателі перед командою bot.start();
 * 
 */


























require('dotenv').config();
const {
  Bot, 
  Keyboard, 
  InlineKeyboard,
  GrammyError,
  HttpError
} = require('grammy');
const { getRandomQuestion, getCorrectAnswer } = require('./utils');

const bot = new Bot(process.env.BOT_API_KEY)

bot.command('start', async (ctx) => {
  const startKeyboard = new Keyboard()
    .text('HTML')
    .text('CSS')
    .row()
    .text('JavaScript')
    .text('React')
    .row()
    .text('Рандомне питання')
    .resized();
  await ctx.reply('Привет! Я - Frontend Question Bot 🎂 \nЯ допоможу тобі підготуватися до інтерв\'\ю по фронтенду ',
  );
  await ctx.reply('З чого почнемо? Вибери тему для опитування в меню 👇', {
    reply_markup: startKeyboard
  });
});

bot.hears(['HTML', 'CSS', 'JavaScript', 'React', 'Рандомне питання'], async (ctx) => {
  const topic = ctx.message.text.toLowerCase();
  const { question, questionTopic } = getRandomQuestion(topic);

  let inLineKeyboard;
    
  if (question.hasOptions) {
    const buttonRows = question.options.map((option) => [
        InlineKeyboard.text(
          option.text, 
          JSON.stringify({
            type: `${questionTopic}-option`,
            isCorrect: option.isCorrect,
            questionId: question.id,
        }),
      ),
    ]);

    inLineKeyboard = InlineKeyboard.from(buttonRows);
  } else {
    inLineKeyboard = new InlineKeyboard().text(
    'Отримати відповідь', 
    JSON.stringify({
      type: questionTopic,
      questionId: question.id,
    }),
  );
}

  await ctx.reply(question.text, {
    reply_markup: inLineKeyboard,
  });
});

bot.on('callback_query:data', async (ctx) => {
  const callbackData = JSON.parse(ctx.callbackQuery.data);
  
  if (!callbackData.type.includes('option')) {
    const answer = getCorrectAnswer(callbackData.type, callbackData.questionId);
    await ctx.reply(answer, {
      parse_mode: 'HTML',
      disable_web_page_preview: true,
    });
    await ctx.answerCallbackQuery();
    return;
  }

  if (callbackData.isCorrect) {
    await ctx.reply('Вірно ✔');
    await ctx.answerCallbackQuery();
    return;
  }

  const answer = getCorrectAnswer(callbackData.type.split('-')[0], callbackData.questionId);
  await ctx.reply(`Не вірно ❌ Вірна відповідь: ${answer}`);
  await ctx.answerCallbackQuery();
});


bot.catch((err) => {
  const ctx = err.ctx;
  console.error(`Error while handling update ${ctx.update.update_id}:`);
  const e = err.error;
  if (e instanceof GrammyError) {
    console.error("Error in request:", e.description);
  } else if (e instanceof HttpError) {
    console.error("Could not contact Telegram:", e);
  } else {
    console.error("Unknown error:", e);
  }
});



bot.start();
































// спрощуємо собі розробку, щоб кожен раз не перезапускать приложеніє
// для цього настраюємо автоматичне обновлення при сохранєнії файлів за допомогою 
// пакета 'nodemon' 
// усстанавлюємо в консолі 'npm i nodemon'
// після установки в `package.json` в свойстві 'scripts' добавим команду для запуска,
// назвемо її "start" і виполнять вона буде команду "nodemon index.js"
// запускуємо бота за допомогою команди "npm start" в консолі.

/* Повернемось до реагування на собитія. Кроме команд ми можемо реагувати на:
- 1) любі сповіщення (щоб на любе повідомлення ми виконували якусь ф-ію);
- 2) на повідомлення з медіа (картинка, відео і т.д.);
- перше і друге робиться за допомогою "bot.on()";
- 3) на повідомлення з конкретним текстом за допомогою "bot.hears();"
- 4) на собитія, (наприклад: редагування повідомлення і тке інше. Подробно можно почитать документацію по `grammy`);
- поки що добавим реагування на конкретні повідомленя, наприклад `HTML`,
при обращенії такого реагування будем відправляти вопрос по HTML,
для цього нам треба метод 'hears' - строка 45;

- добавляєм обработку помилок: - строка 49
- добавим імпорт нужних класів "GrammyError", "HttpError";
- перейдемо до пророботки основного функціоналу бота;
- доработаєм відповідь на команду 'старт'; окрім повідомлення будемо показувати користувачу 
кастомну клавіатуру з вибором тем для питань
- добавляєм класс 'Keyboard' із `grammy` - строка 35
- создаєм клавіатуру также як составляли екземпляр бота через ключове слово 'New',
создаємо її внутрі команди 'Start'// - строка 40
*/

/** Перейдемо до обробки повідомлень:
 * - зараз наш слушатель(строка 54) реагує тільки на сповіщення 'HTML'
 * - можна було під кожну кнопку створити слушатель але треба при
 * тримуватись принципу DRY (Don`t repeat yourself).
 * - Щоб слушатель реагував на декілька різних повідомлень
 * ми передамо до нього не строку, а масив зі строками (строка 54)
а в колбек фу-ю будемо отримувати задану тему із контекста:
в рядку 55 замінюємо обратні кавички і за допомогою '$' i '{}' будемо обращаться до ctx.message.text
тобто у нас там буде виводиться то що пользователь написав
*/

// Перед загрузкой реальних питань створимо іще одну клавіатуру 'Inline Keyboard'
// вона создається як обична, але буде зявлятись під самими повідомленнями
/**Поперше добавим 'Inline Keyboard' в імпорт...  (строка 35)
 * - Тепер створимо клавіатуру (строка 55)
 * передаємо в метод `Text` 2 аргумента:
 * 1- лейбл кнопки
 * 2- прелоуддата
 */

// Зараз при нажатії кнопок нічого не проісходе.
// Нам потрібно вручну добавить реагування на ці події!
// Треба добавить ще один слушатель , який буде реагувати на `callback query`,
// при цьому вказуємо що реагуємо на ті `callback query` в яких є дата 'getAnswer', 'cancel'
// використовуємо метод bot.on() - (строка 63) 
// і передаємо і принажатії получаєм доступ до цього колбека в нашому випадку 'getAnswer', 'cancel'


/* Тепер для отримання рандомного питання по темі потрібно
визвать створену ф-ію, зберегти отримане питання в змінну і
відправити його у відповідь користувачу!!

Для цього отправляємось у 'bot.hears' і там замість "`Що таке ${ctx.message.text}?`" -
-будемо відправляти рандомне питання, (строка 68)
-зберігаємо 'topic' в окрему змінну (строка 62)
-отримаємо рандомне питання (строка 63)
-змінюємо строку 70
-опцію "скасувати" удаляємо (вона була для демонстрації (строка 72))
*/

/* Тепер треба розрізняти питання з варіантами відповідей і без,
-показувати для перших відповідні варіанти в кнопках(4 варіанти),
-а для відкритих питань буде писатися ("Отримати відповідь")б
-складність полягає в тому що кожного разу будуть разні варіанти відповідей,
так що формувати варіанти відповідей на кнопках треба буде динамічно з 
методом "мар", який можна вибрать у масива, перебрати його елементи і повернути резльтативний масив.
Будемо проходитись по масиву варіантів відповідей і на кожен елемент повертати кнопку.
В ітоге вийде масив з кнопками. Потім створити з отриманого масива кнопок - клавіатуру (inlineKeyboard)!
-На строке 65 - 71 закоментуємо стару клавіатуру щоб не заважала.
-За допомогою 'if' зробимо 2 варіанта, (строка 73)
 */

// Далі треба дивитись відео ще раз ("https://www.youtube.com/watch?v=BQr9u6Bb_mE") !!!!!!!!!